### Creating a Dataframe using List

In [3]:
import pandas as pd

In [5]:
lst = ['harshit','sharma', 'nit', 'hamirpur']
pd.DataFrame(lst)

          0
0   harshit
1    sharma
2       nit
3  hamirpur

#### Creating a Dataframe Using Dictionary

In [8]:
data = {'Name':['Harshit', 'Tom', 'Krish'], 'Age':[21, 22, 26]}
pd.DataFrame(data)

      Name  Age
0  Harshit   21
1      Tom   22
2    Krish   26

In [14]:
data2 = {'Name'          :   ['tom' , 'chad' , 'sam'],
         'Age'           :   [23,24,25],
         'ID'            :   [1,2,3],
         'Qualification' :   ['bca', 'mba', 'bsc']}
df = pd.DataFrame(data2)
df

   Name  Age  ID Qualification
0   tom   23   1           bca
1  chad   24   2           mba
2   sam   25   3           bsc

In [16]:
df[['Name','Qualification']]

   Name Qualification
0   tom           bca
1  chad           mba
2   sam           bsc

### Slicing in Dataframe Using Iloc and LOC

In [37]:
data = {'one'    : pd.Series([1,2,3,4]),
        'two'    : pd.Series([10,20,30,40]),
        'three'  : pd.Series([100,200,300,400]),
        'four'   : pd.Series([1000,2000,3000,400])}
df = pd.DataFrame(data)
df.loc[:]

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400   400

In [39]:
df.loc[1:2, 'two':'three']

   two  three
1   20    200
2   30    300

In [59]:
df.iloc[ 0:4 , 0:4 ]

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400   400